erikaraujo578-max/chocadeiras-inteligentes/client/client_esp32.cpp
/*
 * ╔══════════════════════════════════════════════════════════════════╗
 * ║  EA CHOCA+ CLIENT v7.0 — Dispositivo Descentralizado             ║
 * ║  Conecta ao Hub via WebSocket + Web Local Offline                ║
 * ║  Mantém todas as funcionalidades de incubação e controle         ║
 * ╚══════════════════════════════════════════════════════════════════╝
 *
 * FUNCIONALIDADES MANTIDAS:
 *   ✅ Leitura DHT22 (temperatura/umidade)
 *   ✅ Controle de temperatura (banda proporcional 20s)
 *   ✅ Controle de umidade (histerese 5%)
 *   ✅ Servo motor (viragem automática)
 *   ✅ Display OLED 128x64
 *   ✅ Web UI local (painel offline)
 *   ✅ WebSocket ao cloud (painel remoto)
 *   ✅ OTA local
 *   ✅ WiFi Manager
 *
 * NOVO:
 *   ⭐ Primeiro acesso: Registra no cloud automaticamente
 *   ⭐ API Key gerada pelo servidor
 *   ⭐ Sincronização de dados em tempo real
 *   ⭐ Modo local + modo cloud simultâneos
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <DHT.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <ESP32Servo.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>
#include <Update.h>
#include <time.h>
#include <WebServer.h>
#include <Preferences.h>
#include <esp_system.h>
#include <ArduinoWebsockets.h>

using namespace websockets;

// ══════════════════════════════════════════════════════════════
//  VERSÃO
// ══════════════════════════════════════════════════════════════
#define FIRMWARE_VERSION  "7.0"
#define FIRMWARE_NOME     "Aurora Cloud Edition"

// ══════════════════════════════════════════════════════════════
//  PINOS
// ══════════════════════════════════════════════════════════════
#define PIN_DHT           4
#define PIN_RELE_CALOR    5
#define PIN_RELE_UMID     18
#define PIN_SERVO         19
#define RELE_ON           LOW
#define RELE_OFF          HIGH

// ══════════════════════════════════════════════════════════════
//  DEFAULTS
// ══════════════════════════════════════════════════════════════
#define DEFAULT_TEMP          37.8f
#define DEFAULT_UMID          60.0f
#define DEFAULT_HISTERESE     3.0f
#define DEFAULT_INTERVALO_V   4
#define DEFAULT_ESPECIE       "Galinha"
#define DEFAULT_DIAS_TOTAL    21
#define DEFAULT_SERVO_POS     90

// ══════════════════════════════════════════════════════════════
//  LIMITES
// ══════════════════════════════════════════════════════════════
#define TEMP_MIN    35.0f
#define TEMP_MAX    40.0f
#define UMID_MIN    35
#define UMID_MAX    75

// ══════════════════════════════════════════════════════════════
//  TIMINGS
// ══════════════════════════════════════════════════════════════
#define MS_DHT            3000UL
#define MS_DISPLAY        900UL
#define MS_CLOUD_UPDATE   5000UL
#define WS_RECONNECT_MS   6000UL
#define MS_OTA_CHECK      600000UL

// ══════════════════════════════════════════════════════════════
//  REDE
// ══════════════════════════════════════════════════════════════
#define WEB_PORT      80
#define AP_SSID       "EA CHOCA+"
#define AP_PASSWORD   "12345678"
#define AP_TIMEOUT    300

// ══════════════════════════════════════════════════════════════
//  CLOUD DEFAULTS
// ══════════════════════════════════════════════════════════════
#define CLOUD_HOST_DEFAULT  "192.168.1.100"
#define CLOUD_PORT_DEFAULT  3000
#define CLOUD_REGISTER_PATH "/api/device/register"

// ══════════════════════════════════════════════════════════════
//  OLED
// ══════════════════════════════════════════════════════════════
#define OLED_ADDR    0x3C
#define OLED_W       128
#define OLED_H       64

// ══════════════════════════════════════════════════════════════
//  NTP
// ══════════════════════════════════════════════════════════════
#define NTP_SERVER1  "pool.ntp.org"
#define NTP_SERVER2  "time.nist.gov"
#define NTP_TZ       -3

// ══════════════════════════════════════════════════════════════
//  ESTADO GLOBAL
// ══════════════════════════════════════════════════════════════
bool modoAP = false;
bool primeiroAcesso = false;

// ══════════════════════════════════════════════════════════════
//  CONFIG MANAGER
// ══════════════════════════════════════════════════════════════
class ConfigManager {
private:
    Preferences prefs;
public:
    float   setT            = DEFAULT_TEMP;
    float   setH            = DEFAULT_UMID;
    float   histerH         = DEFAULT_HISTERESE;
    int     intervaloV      = DEFAULT_INTERVALO_V;
    String  especie         = DEFAULT_ESPECIE;
    int     diasTotal       = DEFAULT_DIAS_TOTAL;
    int     servoPosRepo    = DEFAULT_SERVO_POS;
    bool    pararViragem    = false;
    bool    incubacaoAtiva  = false;
    time_t  incubacaoInicio = 0;
    String  deviceId        = "";
    String  apiKey          = "";
    bool    cloudEnabled    = false;
    String  cloudHost       = CLOUD_HOST_DEFAULT;
    int     cloudPort       = CLOUD_PORT_DEFAULT;
    bool    cloudSSL        = false;

    void init() {
        prefs.begin("choca_client", false);
        carregar();
        if (deviceId.length() < 6) { 
            deviceId = gerarDeviceId();
            primeiroAcesso = true;
            salvar();
        }
    }

    String gerarDeviceId() {
        uint64_t chipid = ESP.getEfuseMac();
        char id[13];
        sprintf(id, "EA_%04X%04X",
            (uint16_t)(chipid >> 32), (uint16_t)chipid);
        return String(id);
    }

    void carregar() {
        setT            = prefs.getFloat("setT",        DEFAULT_TEMP);
        setH            = prefs.getFloat("setH",        DEFAULT_UMID);
        histerH         = prefs.getFloat("histerH",     DEFAULT_HISTERESE);
        intervaloV      = prefs.getInt("intervaloV",    DEFAULT_INTERVALO_V);
        especie         = prefs.getString("especie",    DEFAULT_ESPECIE);
        servoPosRepo    = prefs.getInt("servoPosRepo",  DEFAULT_SERVO_POS);
        diasTotal       = prefs.getInt("diasTotal",     DEFAULT_DIAS_TOTAL);
        incubacaoInicio = (time_t)prefs.getULong("incubInicio", 0);
        incubacaoAtiva  = prefs.getBool("incubAtiva",   false);
        pararViragem    = prefs.getBool("pararV",       false);
        deviceId        = prefs.getString("deviceId",   "");
        apiKey          = prefs.getString("apiKey",     "");
        cloudEnabled    = prefs.getBool("cloudEnabled", false);
        cloudHost       = prefs.getString("cloudHost",  CLOUD_HOST_DEFAULT);
        cloudPort       = prefs.getInt("cloudPort",     CLOUD_PORT_DEFAULT);
        cloudSSL        = prefs.getBool("cloudSSL",     false);
        
