erikaraujo578-max/chocadeiras-inteligentes/client/client_esp32.cpp
        if (servoPosRepo != 90 && servoPosRepo != 180) servoPosRepo = 90;
        diasTotal = constrain(diasTotal, 1, 60);
    }

    void salvar() {
        prefs.putFloat("setT",        setT);
        prefs.putFloat("setH",        setH);
        prefs.putFloat("histerH",     histerH);
        prefs.putInt("intervaloV",    intervaloV);
        prefs.putString("especie",    especie);
        prefs.putInt("servoPosRepo",  servoPosRepo);
        prefs.putInt("diasTotal",     diasTotal);
        prefs.putULong("incubInicio", (unsigned long)incubacaoInicio);
        prefs.putBool("incubAtiva",   incubacaoAtiva);
        prefs.putBool("pararV",       pararViragem);
        prefs.putString("deviceId",   deviceId);
        prefs.putString("apiKey",     apiKey);
        prefs.putBool("cloudEnabled", cloudEnabled);
        prefs.putString("cloudHost",  cloudHost);
        prefs.putInt("cloudPort",     cloudPort);
        prefs.putBool("cloudSSL",     cloudSSL);
    }

    void resetarIncubacao() { 
        incubacaoInicio = 0; 
        incubacaoAtiva = false; 
        salvar(); 
    }
    
    void iniciarIncubacao()  { 
        time(&incubacaoInicio); 
        incubacaoAtiva = true;  
        salvar(); 
    }

    int diaAtual() {
        if (!incubacaoAtiva || incubacaoInicio == 0) return 0;
        time_t now; time(&now);
        long diff = (long)(now - incubacaoInicio);
        if (diff < 0) diff = 0;
        return constrain((int)(diff / 86400) + 1, 1, diasTotal);
    }

    bool deveVirar() {
        if (pararViragem || !incubacaoAtiva) return false;
        int d = diaAtual();
        if (d <= 2 || d >= diasTotal - 1) return false;
        return true;
    }
};

// ══════════════════════════════════════════════════════════════
//  SISTEMA STATE
// ══════════════════════════════════════════════════════════════
class SistemaState {
public:
    float temperatura = NAN;
    float umidade = NAN;
    int logCount = 0;
};

// ══════════════════════════════════════════════════════════════
//  CONTROLE TEMPERATURA
// ══════════════════════════════════════════════════════════════
class ControleTemperatura {
private:
    float alvo = DEFAULT_TEMP, tAtual = NAN;
    int   pin;
    bool  releLigado = false, modoFull = false, noCiclo = false;
    unsigned long tInicioCiclo = 0, durLigado = 0, tLigouCiclo = 0;
public:
    ControleTemperatura(float a, int p) : alvo(a), pin(p) {
        pinMode(pin, OUTPUT); 
        digitalWrite(pin, RELE_OFF);
    }
    
    void setAlvo(float v) { alvo = v; }
    void setTemperatura(float v) { tAtual = v; }
    bool isLigado() { return releLigado; }
    bool isModoFull() { return modoFull; }

    void atualizar() {
        if (isnan(tAtual)) {
            if (releLigado) { releLigado = false; modoFull = false; digitalWrite(pin, RELE_OFF); }
            return;
        }
        
        float err = alvo - tAtual;
        
        if (tAtual >= (alvo - 0.15f)) {
            if (releLigado) { releLigado = false; noCiclo = false; modoFull = false; digitalWrite(pin, RELE_OFF); }
            return;
        }
        
        if (err > 2.0f) {
            modoFull = true;
            if (!releLigado) { releLigado = true; digitalWrite(pin, RELE_ON); }
            return;
        }
        
        modoFull = false;
        
        float fracao = 0.0f;
        if      (err > 0.8f)  fracao = 1.0f;
        else if (err >= 0.3f) fracao = 0.05f + ((err - 0.3f) / 0.5f) * 0.95f;
        else if (err > 0.0f)  fracao = 0.05f;
        
        durLigado = (unsigned long)(fracao * 20000UL);
        unsigned long agora = millis();
        
        if (agora - tInicioCiclo >= 20000UL) {
            tInicioCiclo = agora;
            if (durLigado > 0 && !releLigado) {
                releLigado = true; noCiclo = true; tLigouCiclo = agora;
                digitalWrite(pin, RELE_ON);
            }
        }
        
        if (releLigado && noCiclo && (agora - tLigouCiclo >= durLigado)) {
            releLigado = false; noCiclo = false; digitalWrite(pin, RELE_OFF);
        }
    }
};

// ══════════════════════════════════════════════════════════════
//  CONTROLE UMIDADE
// ══════════════════════════════════════════════════════════════
class ControleUmidade {
private:
    float alvo = DEFAULT_UMID, uAtual = NAN;
    int   pin;
    bool  releLigado = false;
public:
    ControleUmidade(float a, int p) : alvo(a), pin(p) {
        pinMode(pin, OUTPUT); 
        digitalWrite(pin, RELE_OFF);
    }
    
    void setAlvo(float v) { alvo = v; }
    void setUmidade(float v) { uAtual = v; }
    bool isLigado() { return releLigado; }

    void atualizar() {
        if (isnan(uAtual)) {
            if (releLigado) { releLigado = false; digitalWrite(pin, RELE_OFF); }
            return;
        }
        
        if (!releLigado && uAtual < (alvo - 5.0f)) { 
            releLigado = true;  
            digitalWrite(pin, RELE_ON);  
        }
        else if (releLigado && uAtual >= alvo) { 
            releLigado = false; 
            digitalWrite(pin, RELE_OFF); 
        }
    }
};

// ══════════════════════════════════════════════════════════════
//  CONTROLE SERVO
// ══════════════════════════════════════════════════════════════
class ControleServo {
private:
    Servo servo;
    int   pin, posAtual = 90, posDest = 180, posRepouso = 90;
    bool  ativo = false, estabilizando = false;
    unsigned long tPasso = 0, tEstab = 0;
public:
    ControleServo(int p) : pin(p) { pinMode(pin, INPUT); }
    
    void setPosicaoRepouso(int p) { if (p == 90 || p == 180) posRepouso = p; }
    bool isAtivo() { return ativo; }
    
    int getProgresso() {
        int total = abs(posDest - posRepouso);
        int atual = abs(posAtual - posRepouso);
        return total > 0 ? constrain(atual * 100 / total, 0, 100) : 100;
    }
    
    void iniciarViragem() {
        if (ativo) return;
        posDest = (posRepouso == 90) ? 180 : 90;
        posAtual = posRepouso;
        estabilizando = false;
        pinMode(pin, OUTPUT);
        servo.attach(pin);
        servo.write(posAtual);
        ativo = true; 
        tPasso = millis();
    }
    
