erikaraujo578-max/chocadeiras-inteligentes/client/client_esp32.cpp
    void atualizar() {
        if (!ativo) return;
        unsigned long agora = millis();
        
        if (estabilizando) {
            if (agora - tEstab >= 500) {
                servo.detach(); 
                pinMode(pin, INPUT);
                ativo = false; 
                estabilizando = false;
            }
            return;
        }
        
        if (agora - tPasso < 40) return;
        tPasso = agora;
        
        if (posAtual != posDest) {
            posAtual += (posDest > posAtual) ? 1 : -1;
            servo.write(posAtual);
        } else {
            posRepouso = posDest; 
            estabilizando = true; 
            tEstab = agora;
        }
    }
};

// ══════════════════════════════════════════════════════════════
//  OBJETOS GLOBAIS
// ══════════════════════════════════════════════════════════════
ConfigManager       config;
SistemaState        sistema;
ControleTemperatura controleTemp(DEFAULT_TEMP, PIN_RELE_CALOR);
ControleUmidade     controleUmid(DEFAULT_UMID, PIN_RELE_UMID);
ControleServo       controleServo(PIN_SERVO);
DHT                 dht(PIN_DHT, DHT22);
Adafruit_SSD1306    display(OLED_W, OLED_H, &Wire, -1);
WebServer           webServer(WEB_PORT);

// ══════════════════════════════════════════════════════════════
//  WEBSOCKET CLIENT (Cloud Hub)
// ══════════════════════════════════════════════════════════════
class CloudWS {
private:
    WebsocketsClient client;
    bool conectado = false;
    unsigned long tUltimoStatus = 0, tReconnect = 0;

    void onMsg(WebsocketsMessage msg) {
        DynamicJsonDocument doc(512);
        if (deserializeJson(doc, msg.data())) return;
        
        String c = doc["comando"] | "";
        float v = doc["valor"] | 0.0f;
        
        if (c == "setTemp" && v >= TEMP_MIN && v <= TEMP_MAX) {
            config.setT = v;
            controleTemp.setAlvo(v);
            config.salvar();
            Serial.println("[WS] Temp alterada para " + String(v));
        }
        else if (c == "setUmid" && v >= UMID_MIN && v <= UMID_MAX) {
            config.setH = v;
            controleUmid.setAlvo(v);
            config.salvar();
            Serial.println("[WS] Umid alterada para " + String(v));
        }
        else if (c == "virar") {
            controleServo.iniciarViragem();
            Serial.println("[WS] Viragem remota");
        }
    }
    
    void onEvt(WebsocketsEvent evt, String data) {
        if (evt == WebsocketsEvent::ConnectionOpened) {
            conectado = true;
            Serial.println("[WS] ✅ Conectado ao cloud!");
            handshake();
        } else if (evt == WebsocketsEvent::ConnectionClosed) {
            conectado = false;
            Serial.println("[WS] ❌ Desconectado do cloud");
        }
    }
    
    void handshake() {
        DynamicJsonDocument doc(256);
        doc["tipo"] = "handshake";
        doc["deviceId"] = config.deviceId;
        doc["apiKey"] = config.apiKey;
        doc["firmware"] = FIRMWARE_VERSION;
        doc["tipoDispositivo"] = "chocadeira_client";
        String s;
        serializeJson(doc, s);
        client.send(s);
    }
    
public:
    void init() {
        client.onMessage([this](WebsocketsMessage m) { onMsg(m); });
        client.onEvent([this](WebsocketsEvent e, String d) { onEvt(e, d); });
    }
    
    void conectar() {
        if (!config.cloudEnabled || WiFi.status() != WL_CONNECTED) return;
        if (conectado) return;
        
        unsigned long a = millis();
        if (a - tReconnect < WS_RECONNECT_MS) return;
        tReconnect = a;
        
        String url = "ws://" + config.cloudHost + ":" + String(config.cloudPort);
        Serial.println("[WS] Tentando conectar a " + url);
        client.connect(url);
    }
    
    void loop() {
        if (!config.cloudEnabled) return;
        
        if (client.available()) client.poll();
        if (!conectado) conectar();
        
        if (conectado && millis() - tUltimoStatus >= MS_CLOUD_UPDATE) {
            tUltimoStatus = millis();
            enviarStatus();
        }
    }
    
    void enviarStatus() {
        DynamicJsonDocument doc(512);
        doc["tipo"] = "status";
        doc["deviceId"] = config.deviceId;
        doc["temperatura"] = isnan(sistema.temperatura) ? 0 : sistema.temperatura;
        doc["umidade"] = isnan(sistema.umidade) ? 0 : sistema.umidade;
        doc["setT"] = config.setT;
        doc["setH"] = config.setH;
        doc["intervaloV"] = config.intervaloV;
        doc["especie"] = config.especie;
        doc["diasTotal"] = config.diasTotal;
        doc["diaAtual"] = config.diaAtual();
        doc["incubacaoAtiva"] = config.incubacaoAtiva;
        doc["releCalor"] = controleTemp.isLigado();
        doc["releUmid"] = controleUmid.isLigado();
        doc["modoFull"] = controleTemp.isModoFull() ? 1 : 0;
        doc["servoAtivo"] = controleServo.isAtivo();
        doc["rssi"] = WiFi.RSSI();
        doc["ip"] = WiFi.localIP().toString();
        
        String s;
        serializeJson(doc, s);
        if (conectado) client.send(s);
    }
    
    bool isConectado() { return conectado; }
};

CloudWS wsClient;

// ══════════════════════════════════════════════════════════════
//  REGISTRO NO CLOUD (Primeiro Acesso)
// ══════════════════════════════════════════════════════════════
bool registrarNoCloud() {
    if (config.apiKey.length() > 0) return true;  // Já registrado
    
    HTTPClient http;
    String url = "http://" + config.cloudHost + ":" + String(config.cloudPort) + CLOUD_REGISTER_PATH;
    
    DynamicJsonDocument doc(256);
    doc["deviceId"] = config.deviceId;
    String body;
    serializeJson(doc, body);
    
    http.begin(url);
    http.addHeader("Content-Type", "application/json");
    http.setTimeout(5000);
    
    int code = http.POST(body);
    bool sucesso = false;
    
    if (code == 200) {
        DynamicJsonDocument resp(256);
        if (!deserializeJson(resp, http.getString())) {
            if (resp["ok"]) {
                config.apiKey = resp["apiKey"].as<String>();
                config.cloudEnabled = true;
                config.salvar();
                sucesso = true;
                Serial.println("[CLOUD] ✅ Registrado! API Key: " + config.apiKey.substring(0, 8) + "...");
            }
        }
    }
    
    http.end();
    return sucesso;
}

// ══════════════════════════════════════════════════════════════
//  JSON HELPERS
// ══════════════════════════════════════════════════════════════
String statusJSON() {
    DynamicJsonDocument doc(1024);
    doc["temperatura"] = isnan(sistema.temperatura) ? 0 : sistema.temperatura;
    doc["umidade"] = isnan(sistema.umidade) ? 0 : sistema.umidade;
    doc["setT"] = config.setT;
    doc["setH"] = config.setH;
    doc["intervaloV"] = config.intervaloV;
    doc["especie"] = config.especie;
    doc["diasTotal"] = config.diasTotal;
    doc["diaAtual"] = config.diaAtual();
    doc["incubacaoAtiva"] = config.incubacaoAtiva;
    doc["releCalor"] = controleTemp.isLigado();
    doc["releUmid"] = controleUmid.isLigado();
    doc["modoFull"] = controleTemp.isModoFull();
    doc["servoAtivo"] = controleServo.isAtivo();
    doc["servoPos"] = config.servoPosRepo;
    doc["ip"] = modoAP ? "192.168.4.1" : WiFi.localIP().toString();
    doc["rssi"] = WiFi.RSSI();
    doc["deviceId"] = config.deviceId;
    doc["cloudEnabled"] = config.cloudEnabled;
    doc["wsConectado"] = wsClient.isConectado();
    doc["fwVersion"] = FIRMWARE_VERSION;
    doc["modoAP"] = modoAP;
    
