erikaraujo578-max/chocadeiras-inteligentes/client/client_esp32.cpp
    String s;
    serializeJson(doc, s);
    return s;
}

// ══════════════════════════════════════════════════════════════
//  WEB SERVER LOCAL
// ══════════════════════════════════════════════════════════════
void setupWebServer() {
    // API Status
    webServer.on("/api/status", HTTP_GET, []() {
        webServer.send(200, "application/json", statusJSON());
    });
    
    // API Config
    webServer.on("/api/config", HTTP_POST, []() {
        DynamicJsonDocument doc(512);
        deserializeJson(doc, webServer.arg("plain"));
        
        String acao = doc["acao"];
        
        if (acao == "setTemp") {
            float v = doc["valor"];
            if (v >= TEMP_MIN && v <= TEMP_MAX) {
                config.setT = v;
                controleTemp.setAlvo(v);
                config.salvar();
            }
        }
        else if (acao == "setUmid") {
            float v = doc["valor"];
            if (v >= UMID_MIN && v <= UMID_MAX) {
                config.setH = v;
                controleUmid.setAlvo(v);
                config.salvar();
            }
        }
        else if (acao == "iniciarIncub") {
            config.especie = doc["especie"] | "Galinha";
            config.diasTotal = doc["diasTotal"] | 21;
            config.intervaloV = doc["intervaloV"] | 4;
            if (!config.incubacaoAtiva) config.iniciarIncubacao();
        }
        
        webServer.send(200, "application/json", "{\"ok\":true}");
    });
    
    // API Virar
    webServer.on("/api/virar", HTTP_GET, []() {
        controleServo.iniciarViragem();
        webServer.send(200, "application/json", "{\"ok\":true}");
    });
    
    // Dashboard local (página simples)
    webServer.on("/", HTTP_GET, []() {
        String html = "<h1>🐣 EA CHOCA+ v7.0</h1>";
        html += "<p>Device: " + config.deviceId + "</p>";
        html += "<p>Temperatura: " + String(sistema.temperatura, 1) + "°C</p>";
        html += "<p>Umidade: " + String(sistema.umidade, 0) + "%</p>";
        html += "<p>Cloud: " + String(wsClient.isConectado() ? "✅ Conectado" : "❌ Desconectado") + "</p>";
        webServer.send(200, "text/html", html);
    });
    
    webServer.begin();
    Serial.println("[WEB] Servidor HTTP local iniciado");
}

// ══════════════════════════════════════════════════════════════
//  DISPLAY OLED
// ══════════════════════════════════════════════════════════════
void atualizarDisplay() {
    static uint8_t tela = 0;
    static unsigned long tTela = 0;

    if (!controleServo.isAtivo() && millis() - tTela > 4000) {
        tTela = millis();
        tela = (tela + 1) % 4;
    }

    display.clearDisplay();
    display.setTextColor(WHITE);

    const char* hdr;
    if (modoAP)                      hdr = "MODO AP";
    else if (controleServo.isAtivo()) hdr = "VIRANDO";
    else if (controleTemp.isModoFull()) hdr = "AQUECENDO";
    else switch (tela) {
        case 0: hdr = "TEMPERATURA"; break;
        case 1: hdr = "UMIDADE"; break;
        case 2: hdr = "INCUBACAO"; break;
        default:hdr = "SISTEMA"; break;
    }
    
    display.setTextSize(1);
    display.setCursor(4, 0);
    display.print(hdr);
    display.drawLine(0, 10, 128, 10, WHITE);

    if (controleServo.isAtivo()) {
        display.setTextSize(1);
        display.setCursor(4, 14);
        display.print("Virando...");
        display.drawRect(4, 30, 120, 10, WHITE);
        display.fillRect(4, 30, controleServo.getProgresso() * 120 / 100, 10, WHITE);
    } else if (modoAP) {
        display.setTextSize(1);
        display.setCursor(4, 20);
        display.print("WiFi: EA CHOCA+");
        display.setCursor(4, 35);
        display.print("IP: 192.168.4.1");
        display.setCursor(4, 50);
        display.print("Cloud: " + String(wsClient.isConectado() ? "OK" : "OFF"));
    } else {
        switch (tela) {
            case 0: {
                if (isnan(sistema.temperatura)) {
                    display.setTextSize(1);
                    display.setCursor(20, 30);
                    display.print("ERRO SENSOR");
                } else {
                    display.setTextSize(2);
                    display.setCursor(10, 20);
                    display.print(sistema.temperatura, 1);
                    display.print("C");
                    display.setTextSize(1);
                    display.setCursor(4, 50);
                    display.print("Alvo: " + String(config.setT, 1) + "C");
                }
                break;
            }
            case 1: {
                if (isnan(sistema.umidade)) {
                    display.setTextSize(1);
                    display.setCursor(20, 30);
                    display.print("ERRO SENSOR");
                } else {
                    display.setTextSize(2);
                    display.setCursor(20, 20);
                    display.print((int)sistema.umidade);
                    display.print("%");
                    display.setTextSize(1);
                    display.setCursor(4, 50);
                    display.print("Alvo: " + String((int)config.setH) + "%");
                }
                break;
            }
            case 2: {
                int d = config.diaAtual();
                display.setTextSize(1);
                display.setCursor(4, 14);
                display.print(config.especie);
                if (d > 0) {
                    display.setTextSize(2);
                    display.setCursor(20, 28);
                    display.print("D" + String(d) + "/" + String(config.diasTotal));
                } else {
                    display.setTextSize(1);
                    display.setCursor(4, 35);
                    display.print("Nao iniciada");
                }
                break;
            }
            case 3: {
                display.setTextSize(1);
                display.setCursor(4, 14);
                display.print("ID: " + config.deviceId.substring(0, 10));
                display.setCursor(4, 26);
                display.print("FW: " + String(FIRMWARE_VERSION));
                display.setCursor(4, 38);
                display.print("WS: " + String(wsClient.isConectado() ? "ON" : "OFF"));
                display.setCursor(4, 50);
                display.print("RSSI: " + String(WiFi.RSSI()) + "dBm");
                break;
            }
        }
    }
    
