erikaraujo578-max/chocadeiras-inteligentes/client/client_esp32.cpp
    display.display();
}

// ══════════════════════════════════════════════════════════════
//  TIMERS E SENSORES
// ══════════════════════════════════════════════════════════════
unsigned long tDHT=0, tDisplay=0, tWifiCheck=0, tViragem=0, tOTACheck=0;

void lerSensores() {
    float t = dht.readTemperature();
    float h = dht.readHumidity();
    
    if (!isnan(t) && !isnan(h)) {
        sistema.temperatura = t;
        sistema.umidade = h;
        controleTemp.setTemperatura(t);
        controleUmid.setUmidade(h);
    }
}

void verificarViragem() {
    if (!controleServo.isAtivo() && config.deveVirar() && config.intervaloV > 0) {
        if (millis() - tViragem >= (unsigned long)config.intervaloV * 3600000UL) {
            tViragem = millis();
            controleServo.iniciarViragem();
            Serial.println("[VIRAGEM] Auto D" + String(config.diaAtual()));
        }
    }
}

// ══════════════════════════════════════════════════════════════
//  SETUP
// ══════════════════════════════════════════════════════════════
void setup() {
    Serial.begin(115200);
    Serial.println("\n\nEA CHOCA+ CLIENT v7.0 Aurora — Iniciando...\n");

    pinMode(PIN_RELE_CALOR, OUTPUT);
    digitalWrite(PIN_RELE_CALOR, RELE_OFF);
    pinMode(PIN_RELE_UMID, OUTPUT);
    digitalWrite(PIN_RELE_UMID, RELE_OFF);

    Wire.begin();
    if (display.begin(SSD1306_SWITCHCAPVCC, OLED_ADDR)) {
        display.clearDisplay();
        display.setTextColor(WHITE);
        display.setTextSize(2);
        display.setCursor(8, 10);
        display.print("EA CHOCA+");
        display.setTextSize(1);
        display.setCursor(14, 36);
        display.print("v7.0 Aurora");
        display.setCursor(14, 50);
        display.print("Iniciando...");
        display.display();
    }

    config.init();
    dht.begin();

    WiFi.mode(WIFI_STA);
    WiFiManager wm;
    wm.setConfigPortalTimeout(AP_TIMEOUT);

    bool conectou = wm.autoConnect(AP_SSID, AP_PASSWORD);

    if (conectou) {
        modoAP = false;
        Serial.println("[WiFi] ✅ Conectado: " + WiFi.localIP().toString());
        configTime(NTP_TZ * 3600, 0, NTP_SERVER1, NTP_SERVER2);
        
        // Tentar registrar no cloud se for primeiro acesso
        if (primeiroAcesso && config.apiKey.length() == 0) {
            Serial.println("[SETUP] Primeiro acesso - Registrando no cloud...");
            delay(2000);  // Aguardar conexão estabilizar
            if (registrarNoCloud()) {
                Serial.println("[SETUP] ✅ Registrado com sucesso!");
            } else {
                Serial.println("[SETUP] ⚠️ Registro falhou - Continuando em modo local");
            }
        }
    } else {
        modoAP = true;
        Serial.println("[WiFi] ❌ Modo AP offline");
    }

    setupWebServer();
    wsClient.init();

    controleTemp.setAlvo(config.setT);
    controleUmid.setAlvo(config.setH);
    controleServo.setPosicaoRepouso(config.servoPosRepo);
    tViragem = millis();

    Serial.println("\n[OK] ✅ EA CHOCA+ CLIENT v7.0 pronto!");
    Serial.println("    DeviceID: " + config.deviceId);
    Serial.println("    Cloud: " + String(config.cloudEnabled ? "ATIVO" : "INATIVO"));
    Serial.println("    Web Local: http://" + (modoAP ? "192.168.4.1" : WiFi.localIP().toString()));
}

// ══════════════════════════════════════════════════════════════
//  LOOP
// ══════════════════════════════════════════════════════════════
void loop() {
    unsigned long agora = millis();

    webServer.handleClient();

    if (!modoAP) wsClient.loop();

    // Sensores
    if (agora - tDHT >= MS_DHT) {
        tDHT = agora;
        lerSensores();
    }

    // Controles
    controleTemp.atualizar();
    controleUmid.atualizar();
    controleServo.atualizar();

    // Viragem
    verificarViragem();

    // Display
    if (agora - tDisplay >= MS_DISPLAY) {
        tDisplay = agora;
        atualizarDisplay();
    }

    delay(10);
}
